ppet36/euc_dashboard/esp32_up_down_sd.cpp
/**
 * Emulates standard functions My Circuits 2022, based on code of David Bird 2018 
 * using command mode of OpenLOG. More info in video:
 *
 * https://www.youtube.com/watch?v=zoYMU1tA3nI
 *
 * Configuration file /config.txt on SD card is expected with contents:
 * 115200,26,1,2,1,1,0
 *
 * 115200 - Baudrate
 * 26 - Escape character to return to command mode
 * 1 - Escape character #
 * 2 - Mode; initially command mode (2)
 * 1 - Verbosity
 * 1 - Echo
 * 0 - Ignore RX 
 *
 * File name: esp32_up_down_sd.h
 * Date:      2024/04/06 19:18
 * Author:    ppet36
*/

#include <WiFi.h>
#include <ESP32WebServer.h>    //https://github.com/Pedroalbuquerque/ESP32WebServer download and place in your Libraries folder
#include <ESPmDNS.h>
#include "StringTokenizer.h"

#include "CSS.h" //Includes headers of the web and de style file

#include "esp32_up_down_sd.h"

#define OPENLOG_BAUD 115200
#define OPENLOG_RX 26
#define OPENLOG_TX 25
#define OPENLOG_RESET 27
#define OPENLOG_MAX_SIZE 32768
#define OPENLOG_TRANSFER_BUFF_SIZE (size_t)80

#define OPENLOG_ESC 26 // Ctrl+Z
#define OPENLOG_TIMEOUT 3000
#define OPENLOG_INPUT_PROMPT '>'
#define OPENLOG_OUTPUT_PROMPT '<'

// Webserver
ESP32WebServer server(80);

// OpenLOG connection
#define openLog Serial1

// Inidicates whether SD card is present
bool SD_present = false;

// Flag if append log file initiated.
bool append_active = false;

// Disk size in bytes
uint64_t disk_size = 0;

// Current fragment size
uint16_t current_log_fragment_size = 0;

// Current fragment index
uint16_t current_log_fragment_index = 1;

// Webpage creation space
String webpage;

// HH:MM:SS;speed;euc_temp;euc_dist_since_charge;euc_phase_current;bms_voltage;bms_current;battery_level;bms_temp;bat1_temp;bat2_temp;bms_balance_cur;
const char CSV_HEADERS[] PROGMEM = "Time;Speed;EUC temp;EUC dist. since charge;EUC phase current;BMS voltage;BMS current;Battery level;BMS temp;Battery temp1;Battery temp2;BMS ballance current;";


// External logging function which prints to serial and display.
extern void logLine(String s);
extern void log(String s);
extern void logLine();
extern void displaySet(String field, String value);


// Display updates
void displaySetStatus (String status) {
  displaySet (F("InfoLabel"), status);
}

void displayClearStatus() {
  displaySet (F("InfoLabel"), "");
}

// Wait for character with OPENLOG_TIMEOUT timeout.
bool OL_wait_for_char (char ch, unsigned int offset = 0, char* payload = 0, size_t payload_size = 0) {
  unsigned long t = millis();
  off_t pos = 0;
  int c;
  int readed = 0;  

  memset(payload, 0, payload_size);

  Serial.print (F("Waiting for char \""));
  Serial.print (ch);
  Serial.print (F("\""));

  while (millis() - t < OPENLOG_TIMEOUT) {
    if (openLog.available()) {
      c = openLog.read();

      if (c == ch) {
        Serial.print (F("... Char found at position "));
        Serial.println (pos);
        return true;
      }

      readed++;

      if (payload && (pos < payload_size) && (readed > offset)) {
        payload[pos++] = c;
      }
    } else {
      yield();
    }
  }

  Serial.print (F("... Char not found in timeout "));
  Serial.println (OPENLOG_TIMEOUT);

  return false;
}

void OL_empty_queue() {
  while (openLog.available()) {
    openLog.read();
    delay(1);
  }
}

bool OL_send_command (String command, char waitFor = OPENLOG_INPUT_PROMPT, char* payload = 0, size_t payload_size = 0) {
  OL_empty_queue();

  openLog.print(command);
  openLog.write(13);
  Serial.print(F("Sent command \""));
  Serial.print(command);
  Serial.println(F("\""));
  if (OL_wait_for_char (waitFor, command.length(), payload, payload_size)) {
    return true;
  }
  return false;
}


void OL_reset(void) {
  digitalWrite (OPENLOG_RESET, LOW);
  delay(500);
  digitalWrite (OPENLOG_RESET, HIGH);
  delay (250);
  OL_send_command ("reset", OPENLOG_INPUT_PROMPT);
}

// Initialize connection to OpenLOG.
void SD_setup(void) {
  char diskInfo[512];

  logLine(F("Initializing OpenLOG..."));
  openLog.begin(OPENLOG_BAUD, SERIAL_8N1, OPENLOG_RX, OPENLOG_TX);

  if (OL_send_command ("disk", OPENLOG_INPUT_PROMPT, diskInfo, sizeof(diskInfo))) {
    Serial.print (diskInfo);

    char* needle = strstr (diskInfo, "Card Size:");
    if (needle) {
      if (sscanf (needle, "Card Size: %u KB", &disk_size) == 1) {
        disk_size *= (1024 * 1024);
      }
    }

    log (F("Parsed disk size: "));
    log (String(disk_size));
    logLine (F(" bytes"));

    SD_present = (disk_size > 0);
  } else {
    SD_present = false;
    logLine (F("Failed to connect to OpenLOG..."));
  }

  log (F("SD_present is "));
  logLine(String(SD_present));
}

void SD_setup_wifi(void) {  
  WiFi.softAP(WIFI_SSID, WIFI_PASSWORD);
  
  //Set your preferred server name, if you use "mcserver" the address would be http://mcserver.local/
  if (!MDNS.begin(servername)) {          
    logLine(F("Error setting up MDNS responder!"));
    delay (1000);
    ESP.restart(); 
  }
  
  /*********  Server Commands  **********/
  server.on("/",         SD_dir);
  server.on("/upload",   SD_file_upload);
  server.on("/fupload",  HTTP_POST,[](){ server.send(200);}, SD_handle_file_upload);

  server.begin();
  
  logLine("HTTP server started...");
  delay(500);
}

/*********  LOOP  **********/

void SD_loop_wifi(void) {
  server.handleClient();
}

bool save_current_log_fragment (DateTime time) {
  char file_name [20];
  char payload [32];

  sprintf (file_name, "/%04d%02d%02d.idx", time.year(), time.month(), time.day());
  if (OL_send_command("rm " + String(file_name)) && OL_send_command ("append " + String(file_name), OPENLOG_OUTPUT_PROMPT)) {
    openLog.println(current_log_fragment_index);

    Serial.print (F("Written current fragment index "));
    Serial.println (current_log_fragment_index);

    delay(500);
    return SD_command_mode();
  } else {
    return false;
  }
}

void SD_write_log (DateTime time, const char* value) {
  if (SD_present) {
    static uint8_t last_log_day = time.day();

    if (!append_active) {
      char file_name [20];
      char payload [32];
      bool new_file = false;

      sprintf (file_name, "/%04d%02d%02d.idx", time.year(), time.month(), time.day());
      if (OL_send_command ("size " + String(file_name), OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
        if (atoi(payload) < 0) {
          Serial.print (F("Fragment index file "));
          Serial.print (file_name);
          Serial.println (F(" not found."));

          current_log_fragment_index = 1;

          if (!save_current_log_fragment(time)) {
            SD_present = false;
            return;
          }
        } else {
          if (OL_send_command ("read " + String(file_name), OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
            current_log_fragment_index = atoi(payload);
            Serial.print (F("Current fragment index is "));
            Serial.println (current_log_fragment_index);
          } else {
            SD_present = false;
            return;
          }
        }
      } else {
        SD_present = false;
        return;
      }

      sprintf (file_name, "/%04d%02d%02d.%03d", time.year(), time.month(), time.day(), current_log_fragment_index);
      if (OL_send_command ("size " + String(file_name), OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
        int file_size = atoi (payload);
        Serial.print (F("File "));
        Serial.print (file_name);
        Serial.print (F(" size is "));
        Serial.print (file_size);
        Serial.println (F(" bytes."));

        new_file = (file_size < 0);
        current_log_fragment_size = new_file ? 0 : file_size;

      } else {
        SD_present = false;
        return;
      }

      if (!OL_send_command ("append " + String(file_name), OPENLOG_OUTPUT_PROMPT)) {
        SD_present = false;
        return;
      }

