ppet36/euc_dashboard/esp32_up_down_sd.cpp
      if (new_file && (current_log_fragment_index < 2)) {
        openLog.print (CSV_HEADERS);
        openLog.println();
        current_log_fragment_size += strlen(CSV_HEADERS) + 2;
      }

      append_active = true;

    } else {
      if (last_log_day != time.day()) {
        Serial.print (F("Day changed "));
        Serial.print (last_log_day);
        Serial.print (F("<>"));
        Serial.print (time.day());
        Serial.println (F("; rotating."));

        if (SD_command_mode()) {
          append_active = false;
          last_log_day = time.day();
          SD_write_log (time, value);
          return;
        } else {
          SD_present = false;
          return;
        }
      }

      if (current_log_fragment_size > OPENLOG_MAX_SIZE) {
        Serial.print (F("Log max size "));
        Serial.print (OPENLOG_MAX_SIZE);
        Serial.println (F(" reached; rotating."));

        current_log_fragment_index++;

        if (SD_command_mode() && save_current_log_fragment (time)) {
          append_active = false;
          SD_write_log (time, value);
          return;
        } else {
          SD_present = false;
          return;
        }
      }
    }

    openLog.print(value);
    openLog.println();
    current_log_fragment_size += strlen(value) + 2;
  }
}

bool SD_command_mode(void) {
  unsigned long t = millis();
  do {
    Serial.println (F("Sending command mode character..."));
    openLog.write (OPENLOG_ESC);
    openLog.flush();
    if (OL_wait_for_char(OPENLOG_INPUT_PROMPT)) {
      Serial.println (F("Switched to command mode..."));
      return true;
    }
    delay (250);
  } while (millis() - t < OPENLOG_TIMEOUT * 3);

  Serial.println (F("Cant switch to command mode!"));

  return false;
}

void SD_flush(void) {
  if (SD_present) {
    if (append_active) {
      Serial.println (F("Append active; swiching to command mode..."));
      if (!SD_command_mode()) {
        return;
      }
      append_active = false;
    }

    if (!OL_send_command ("sync")) {
      SD_present = false;
      return;
    }
  }
}

bool SD_initialized() {
  return SD_present;
}

void SD_info(uint64_t* used_by_files, uint64_t* free, int* count_files) {
  unsigned long t = millis();
  char c;
  char line [128];
  char file_name [20];
  unsigned int file_size;
  off_t pos = 0;
  uint64_t file_space = 0;

  (* used_by_files) = 0;
  (* free) = 0;
  (* count_files) = 0;

  if (!SD_present) {
    return;
  }

  delay(500);
  SD_flush();

  memset(line, 0, sizeof(line));

  OL_empty_queue();

  openLog.print("ls");
  openLog.write(13);

  while (millis() - t < OPENLOG_TIMEOUT) {
    if (openLog.available()) {
      c = openLog.read();
      if (c == OPENLOG_INPUT_PROMPT) {
        break;
      }

      if (c == '\n') {
        if (sscanf (line, "%s %u", file_name, &file_size) == 2) {
          Serial.print (file_name);
          Serial.print ('\t');
          Serial.println (file_size);
          (* used_by_files) += file_size;
          (* count_files)++;
        }

        memset(line, 0, sizeof(line));
        pos = 0;
      }

      line[pos++] = c;
      if (pos >= sizeof(line)) {
        break;
      }
    }
  }

  (* free) = disk_size - (* used_by_files);
}

uint64_t SD_disk_size() {
  return disk_size;
}

/*********  FUNCTIONS  **********/
//Initial page of the server web, list directory and give you the chance of deleting and uploading
void SD_dir() {
  if (SD_present) {
    if (server.args() > 0) {
      String order = server.arg(0);
      Serial.print (F("Server arg[0] is "));
      Serial.println (order);

      if (order.indexOf("view_") >= 0) {
        order.remove(0,5);
        SD_file_download(order, "inline");
        return;
      }


      if (order.indexOf("download_") >= 0) {
        order.remove(0,9);
        SD_file_download(order, "attachment");
        return;
      }
  
      if (order.indexOf("delete_") >= 0) {
        order.remove(0,7);
        SD_file_delete(order);
        return;
      }
    }

    displaySetStatus (F("Reading SD files..."));

    SendHTML_Header();    
    webpage += F("<table align='center'>");
    webpage += F("<tr><th>Name</th><th>Size</th><th colspan='3'>Actions</th></tr>");
    SD_print_directory();
    webpage += F("</table>");
    SendHTML_Content();
    append_page_footer();
    SendHTML_Content();
    SendHTML_Stop();

    displayClearStatus();
  } else {
    ReportSDNotPresent();
  }
}

//Upload a file to the SD
void SD_file_upload() {
  append_page_header();
  webpage += F("<h3>Select File to Upload</h3>"); 
  webpage += F("<FORM action='/fupload' method='post' enctype='multipart/form-data'>");
  webpage += F("<input class='buttons' style='width:25%' type='file' name='fupload' id = 'fupload' value=''>");
  webpage += F("<button class='buttons' style='width:10%' type='submit'>Upload File</button><br><br>");
  webpage += F("<a href='/'>[Back]</a><br><br>");
  append_page_footer();
  server.send(200, "text/html",webpage);
}

//Prints the directory, it is called in void SD_dir() 
void SD_print_directory() {
  unsigned long t = millis();
  char c;
  char line [64];
  char file_name [20];
  char display_name [20];
  char payload [32];
  int file_size;
  off_t pos = 0;

  String lazyInitSizes = "";

  OL_reset();

  memset(line, 0, sizeof(line));

  OL_empty_queue();
  openLog.print("ls");
  openLog.write(13);

  while (millis() - t < OPENLOG_TIMEOUT * 2) {
    if (openLog.available()) {
      c = openLog.read();
      if (c == OPENLOG_INPUT_PROMPT) {
        break;
      }

      if (c == '\n') {
        if (sscanf (line, "%s %u", file_name, &file_size) == 2) {
          if (webpage.length() > 1000) {
            SendHTML_Content();
          }

          sprintf (display_name, "%s", file_name);
          String fsize = SD_file_size (file_size);

          int y = 0, m = 0, d = 0, part = 0;
          int scanned = sscanf (file_name, "%04d%02d%02d.%03d", &y, &m, &d, &part);

          if (scanned == 4) {
            continue;
          } else if (scanned == 3) {
            sprintf (display_name, "%04d-%02d-%02d", y, m, d);
            fsize = "-";
            lazyInitSizes += String(file_name) + ",";
          }

          webpage += "<tr><td>" + String(display_name) + "</td>";
          webpage += "<td id='fs" + String(file_name) + "'>" + fsize + "</td>";
          webpage += "<td>";
          webpage += F("<FORM action='/' method='post'>"); 
          webpage += F("<button type='submit' name='view'"); 
          webpage += F(" value='"); webpage += "view_" + String(file_name); webpage += F("'>View</button>");
          webpage += "</td>";
          webpage += "<td>";
          webpage += F("<FORM action='/' method='post'>"); 
          webpage += F("<button type='submit' name='download'"); 
          webpage += F(" value='"); webpage += "download_" + String(file_name); webpage += F("'>Download</button>");
          webpage += "</td>";
          webpage += "<td>";
          webpage += F("<FORM action='/' method='post'>"); 
          webpage += F("<button type='submit' name='delete'"); 
          webpage += F(" value='"); webpage += "delete_" + String(file_name); webpage += F("'>Delete</button>");
          webpage += "</td>";
          webpage += "</tr>";
        }

        memset(line, 0, sizeof(line));
        pos = 0;
      }

      line[pos++] = c;
      if (pos >= sizeof(line)) {
        break;
      }
    }
  }


  webpage += "<script>";

  StringTokenizer sizes(lazyInitSizes, ",");
  while (sizes.hasNext()) {
    String fn = sizes.nextToken();
    String date_part = fn.substring(0, 8);
    uint32_t total_size = 0;

