ppet36/euc_dashboard/esp32_up_down_sd.cpp
    for (int part = 1; part <= 999; part++) {
      char pn [32];
      sprintf (pn, "/%s.%03d", date_part.c_str(), part);

      if (OL_send_command ("size " + String(pn), OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
        file_size = atoi (payload);

        if (file_size < 0) {
          break;
        }

        total_size += file_size;
      }
    }

    webpage += "document.getElementById('fs" + fn + "').innerHTML = '" + SD_file_size (total_size) + "';";
  }
  webpage += "</script>";
}

off_t transfer_file_from_sd_card (String filename) {
  char buffer [OPENLOG_TRANSFER_BUFF_SIZE * 3 + 20];
  off_t pos = 0;
  char payload [32];
  int file_size;

  displaySetStatus ("Transfering file " + filename + " ...");

  Serial.print (F("Starting file "));
  Serial.print (filename);
  Serial.println (F(" download..."));

  if (OL_send_command ("size " + filename, OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
    int file_size = atoi (payload);

    Serial.print (F("File "));
    Serial.print (filename);
    Serial.print (F(" size is "));
    Serial.print (file_size);
    Serial.println (F(" bytes."));

    while (pos < file_size) {
      size_t to_read = min (OPENLOG_TRANSFER_BUFF_SIZE, (size_t)(file_size - pos));
 
      // Read block of file in HEX
      String command = "read " + filename + " ";
      command += String(pos);
      command += " ";
      command += String(to_read);
      command += " 2";
 
      if (OL_send_command(command, OPENLOG_INPUT_PROMPT, buffer, sizeof(buffer))) { 
        char hexBuff [3];
        char decBuff [to_read];
        uint16_t decBuffIndex = 0;
        uint16_t bufferIndex = 0;
 
        memset(hexBuff, 0, sizeof(hexBuff));
 
        // Skip initial carriage returns
        while (bufferIndex < to_read * 3) {
          if (isprint (buffer[bufferIndex])) {
            break;
          }
          bufferIndex++;
        }
 
        while ((decBuffIndex < to_read) && (bufferIndex < sizeof(buffer))) {
          memcpy (hexBuff, &buffer[bufferIndex], 2);
 
          char ch = (char) strtol(hexBuff, NULL, 16);
          if ((ch == 0x0A) || (ch == 0x0D) ||  isprint (ch)) {
            decBuff[decBuffIndex] = ch;
            decBuffIndex++;
          } else {
            break;
          }
 
          // 0x0A, 0x0D comes as single character
          bufferIndex += (hexBuff[1] == ' ') ? 2 : 3;
        }
 
        Serial.println();
        Serial.print (F("Converted "));
        Serial.print (decBuffIndex);
        Serial.println (F(" bytes."));
 
        pos += decBuffIndex;
 
        server.client().write (decBuff, decBuffIndex);
 
        delay(250);
      } else {
        return -1;
      }
    }
 
    Serial.print(F("Transfered "));
    Serial.print(pos);
    Serial.println (F(" bytes."));
  } else {
    return -1;
  }

  displayClearStatus();

  return pos;
}


//Download a file from the SD, it is called in void SD_dir()
void SD_file_download (String filename, String content_disposition) {
  unsigned long t;
  char c;
  int file_size;
  size_t total_size = 0;
  char payload [256];

  OL_reset();

  server.sendHeader("Content-Type", "text/plain");
  server.sendHeader("Connection", "close");

  if (filename.endsWith(".idx")) {
    // Day metrics
    String date_part = filename.substring(0, 8);
    char file_name [32];

    server.sendHeader ("Content-Disposition", content_disposition + "; filename=" + date_part + String(".csv"));

    uint64_t total_transfered = 0;
    uint16_t part_count = 0;

    for (int part = 1; part <= 999; part++) {
      char pn [32];
      sprintf (pn, "/%s.%03d", date_part.c_str(), part); 

      if (OL_send_command ("size " + String(pn), OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
        file_size = strtol (payload, NULL, 10);

        Serial.print (F("File "));
        Serial.print (pn);
        Serial.print (F(" size is "));
        Serial.print (file_size);
        Serial.println (F(" bytes."));

        if (file_size < 0) {
          break;
        }

        total_size += file_size;

        part_count++;
      }
    }

    Serial.print (F("Total files size "));
    Serial.print (total_size);
    Serial.println (F(" bytes."));

    server.setContentLength (total_size);
    server.send (200, "text/csv", "");

    delay(250);

    for (int part = 1; part <= part_count; part++) {
      char pn [32];
      off_t transfered;

      sprintf (pn, "%s.%03d", date_part.c_str(), part);

      transfered = transfer_file_from_sd_card (pn);
      if (transfered < 0) {
        Serial.print (F("Transfer of file "));
        Serial.print (pn);
        Serial.println (F(" failed."));
        break;
      }

      total_transfered += transfered;
    }

    Serial.print (F("Total transfered "));
    Serial.print (total_size);
    Serial.println (F(" bytes."));
  } else {
    // Plain file
    if (OL_send_command ("size " + filename, OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
      file_size = atoi (payload);

      Serial.print (F("File "));
      Serial.print (filename);
      Serial.print (F(" size is "));
      Serial.print (file_size);
      Serial.println (F(" bytes."));

      server.sendHeader ("Content-Disposition", content_disposition + "; filename=" + filename);
      server.setContentLength (file_size);
      server.send (200, "text/plain", "");

      transfer_file_from_sd_card (filename);
    }
  }
}

//Upload a new file to the Filing system
void SD_handle_file_upload() {

  HTTPUpload& uploadfile = server.upload(); //See https://github.com/esp8266/Arduino/tree/master/libraries/ESP8266WebServer/srcv
                                            //For further information on 'status' structure, there are other reasons such as a failed transfer that could be used
  if(uploadfile.status == UPLOAD_FILE_START) {
    String filename = uploadfile.filename;
    if(!filename.startsWith("/")) {
      filename = "/" + filename;
    }

    Serial.print(F("Starting upload of file "));
    Serial.println (filename);

    displaySetStatus ("Uploading file" + filename + "...");

    OL_send_command ("rm " + filename);

    OL_empty_queue();
    openLog.print("append ");
    openLog.print(filename);
    openLog.write(13);
    append_active = true;

    filename = String();
  } else if (uploadfile.status == UPLOAD_FILE_WRITE) {
    openLog.write (uploadfile.buf, uploadfile.currentSize);
    Serial.print (F("Written "));
    Serial.print (uploadfile.currentSize);
    Serial.println (F(" bytes."));
  } else if (uploadfile.status == UPLOAD_FILE_END) {
    SD_flush();

