ppet36/euc_dashboard/esp32_up_down_sd.cpp
    Serial.print (F("File "));
    Serial.print (uploadfile.filename);
    Serial.println (F(" successfully uploaded..."));

    displayClearStatus();

    webpage = "";
    append_page_header();
    webpage += F("<h3>File was successfully uploaded</h3>"); 
    webpage += F("<h2>Uploaded File Name: "); webpage += uploadfile.filename+"</h2>";
    webpage += F("<h2>File Size: "); webpage += SD_file_size(uploadfile.totalSize) + "</h2><br><br>"; 
    webpage += F("<a href='/'>[Back]</a><br><br>");
    append_page_footer();

    server.send(200,"text/html",webpage);
  } else {
    ReportCouldNotCreateFile("upload");
  }
}

//Delete a file from the SD, it is called in void SD_dir()
void SD_file_delete(String filename) {
  if (SD_present) {
    displaySetStatus ("Deleting file " + filename + "...");
    
    SendHTML_Header();

    SD_flush();

    bool resl = true;
    if (filename.endsWith (".idx")) {
      String date_part = filename.substring(0, 8);
      char payload[32];

      if (OL_send_command ("read /" + filename, OPENLOG_INPUT_PROMPT, payload, sizeof(payload))) {
        int part_count = atoi (payload);

        Serial.print (F("Index file /"));
        Serial.print (filename);
        Serial.print (F(" has "));
        Serial.print (part_count);
        Serial.println (F(" part count."));

        for (int part = 1; part <= part_count; part++) {
          char pn [32];
          sprintf (pn, "/%s.%03d", date_part.c_str(), part); 

          if (!OL_send_command ("rm " + String(pn))) {
            resl = false;
          }
        }

        if (resl) {
          resl = OL_send_command ("rm " + filename);
        }
      } else {
        resl = false;
      }
    } else {
      resl = OL_send_command ("rm " + filename);
    }

    if (resl) {
      webpage += "<h3>File '"+filename+"' has been deleted</h3>"; 
      webpage += F("<a href='/'>[Back]</a><br><br>");
    } else { 
      webpage += F("<h3>File was not deleted - error</h3>");
      webpage += F("<a href='/'>[Back]</a><br><br>");
    }

    append_page_footer(); 
    SendHTML_Content();
    SendHTML_Stop();

    displayClearStatus();
  } else {
    ReportSDNotPresent();
  }
}

//SendHTML_Header
void SendHTML_Header() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate"); 
  server.sendHeader("Pragma", "no-cache"); 
  server.sendHeader("Expires", "-1"); 
  server.setContentLength(CONTENT_LENGTH_UNKNOWN); 
  server.send(200, "text/html", ""); //Empty content inhibits Content-length header so we have to close the socket ourselves. 
  append_page_header();
  server.sendContent(webpage);
  webpage = "";
}

//SendHTML_Content
void SendHTML_Content() {
  server.sendContent(webpage);
  webpage = "";
}

//SendHTML_Stop
void SendHTML_Stop() {
  server.sendContent("");
  server.client().stop(); //Stop is needed because no content length was sent
}

//ReportSDNotPresent
void ReportSDNotPresent() {
  SendHTML_Header();
  webpage += F("<h3>No SD Card present</h3>"); 
  webpage += F("<a href='/'>[Back]</a><br><br>");
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop();
}

//ReportCouldNotCreateFile
void ReportCouldNotCreateFile(String target) {
  SendHTML_Header();
  webpage += F("<h3>Could Not Create Uploaded File</h3>"); 
  webpage += F("<a href='/"); webpage += target + "'>[Back]</a><br><br>";
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop();
}

//File size conversion
String SD_file_size(uint64_t bytes) {
  String fsize = "";
  if (bytes < 1024)                 fsize = String(bytes) +" B";
  else if(bytes < (1024*1024))      fsize = String(bytes/1024.0,3) + " KB";
  else if(bytes < (1024*1024*1024)) fsize = String(bytes/1024.0/1024.0,3) + " MB";
  else                              fsize = String(bytes/1024.0/1024.0/1024.0,3) + " GB";
  return fsize;
}

void append_page_header() {
  webpage  = F("<!DOCTYPE html><html>");
  webpage += F("<head>");
  webpage += F("<title>EUC Metric Server</title>");
  webpage += F("<meta name='viewport' content='user-scalable=yes,initial-scale=1.0,width=device-width'>");
  webpage += F("<style>");
  webpage += F("body{max-width:65%;margin:0 auto;font-family:arial;font-size:100%;}");
  webpage += F("ul{list-style-type:none;padding:0;border-radius:0em;overflow:hidden;background-color:#d90707;font-size:1em;}");
  webpage += F("li{float:left;border-radius:0em;border-right:0em solid #bbb;}");
  webpage += F("li a{color:white; display: block;border-radius:0.375em;padding:0.44em 0.44em;text-decoration:none;font-size:100%}");
  webpage += F("li a:hover{background-color:#e86b6b;border-radius:0em;font-size:100%}");
  webpage += F("h1{color:white;border-radius:0em;font-size:1.5em;padding:0.2em 0.2em;background:#d90707;}");
  webpage += F("h2{color:blue;font-size:0.8em;}");
  webpage += F("h3{font-size:0.8em;}");
  webpage += F("table{font-family:arial,sans-serif;font-size:0.9em;border-collapse:collapse;width:85%;}"); 
  webpage += F("th,td {border:0.06em solid #dddddd;text-align:left;padding:0.3em;border-bottom:0.06em solid #dddddd;}"); 
  webpage += F("tr:nth-child(odd) {background-color:#eeeeee;}");
  webpage += F(".rcorners_n {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:20%;color:white;font-size:75%;}");
  webpage += F(".rcorners_m {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:50%;color:white;font-size:75%;}");
  webpage += F(".rcorners_w {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:70%;color:white;font-size:75%;}");
  webpage += F(".column{float:left;width:50%;height:45%;}");
  webpage += F(".row:after{content:'';display:table;clear:both;}");
  webpage += F("*{box-sizing:border-box;}");
  webpage += F("a{font-size:75%;}");
  webpage += F("p{font-size:75%;}");
  webpage += F("</style></head><body><h1>EUC Metric server</h1>");
  webpage += F("<ul>");
  webpage += F("<li><a href='/'>Days / Files</a></li>");
  webpage += F("<li><a href='/upload'>Upload</a></li>"); 
  webpage += F("</ul>");
}

//Saves repeating many lines of code for HTML page footers
void append_page_footer() { 
  webpage += F("</body></html>");
}

